{"input_text":"Info Pelamar:\nDanang Hapis Fadillah\nUniversitas Indraprasta PGRI\nTeknik Informatika\n\nJob Description:\n**Keahlian yang dibutuhkan : **\n1. Frontend Developer, minimal pengalaman 2 tahun\n2. Berpengalaman dalam bahasa pemrograman Javascript dan Typescript\n3. Berpengalaman dalam menggunakan framework React Js, Next Js, Vue\n4. Berpengalaman dalam menggunakan framework Tailwind\n5. Pernah mengerjakan beberapa project menggunakan framework React Js / Next Js / Vue\n6. Mampu menghasilkan code yang clean dan rapi sesuai dengan kebutuhan aplikasi\n7. Dapat melakukan testing internal dan deployment fixing, troubleshooting, debugging dan improvement\n\n** Persyaratan **: \n1. Sarjana S1 dibidang Komputer / IT / MI / Sejenis\n2. Memiliki sertifikat pelatihan / course / lainnya yang berkaitan dengan Frontend Development\n3. Dapat bekerja dengan deadline yang ketat\n4. Mampu kerja dalam tekanan terhadap target pada fase development aplikasi\n5. Dapat bekerja sendiri atau dengan Tim\n6. Bersedia melakukan kunjungan untuk Progres Report dan Sosialisasi Aplikasi ke luar / dalam kota\n7. Bersedia lembur jika dibutuhkan\n8. Memiliki motivasi tinggi, disiplin, kreatif, jujur, dan bertanggung jawab\n9. Senang belajar dengan hal – hal baru\n10. Penempatan di kota Bandung","output_text":"1. Bisa ceritakan perjalanan Anda menuju karier di bidang Frontend Development?\n2. Apa yang membuat Anda memilih Teknik Informatika di Universitas Indraprasta PGRI?\n3. Dari proyek yang pernah Anda kerjakan, mana yang paling menantang, dan bagaimana Anda mengatasinya?\n4. Bagaimana pengalaman Anda menggunakan framework seperti React, Next.js, atau Vue dalam proyek nyata?\n5. Saat diminta untuk membuat kode yang clean dan efisien, langkah apa yang Anda ambil untuk memastikan kualitas kode?\n6. Pernahkah Anda mengalami kendala saat debugging atau troubleshooting? Bagaimana Anda menyelesaikan masalah tersebut?\n7. Bisa jelaskan pengalaman Anda dengan Tailwind? Bagaimana Anda membandingkannya dengan framework CSS lainnya?\n8. Misalkan Anda harus menyelesaikan fitur baru dalam waktu yang sangat terbatas. Apa strategi Anda untuk memenuhi deadline tersebut?\n9. Jika Anda sedang bekerja dalam tim dan ada anggota yang kinerjanya kurang optimal, bagaimana Anda menyikapinya?\n10. Ada permintaan perubahan besar dari klien di tengah-tengah proyek. Bagaimana Anda merespons situasi ini?\n11. Apa yang memotivasi Anda untuk terus mendalami dunia Frontend Development?\n12. Di mana Anda melihat diri Anda dalam lima tahun ke depan dalam karier Anda?\n13. Dengan berbagai tugas yang harus diselesaikan, bagaimana Anda mengatur prioritas pekerjaan Anda?\n14. Apakah Anda bersedia ditempatkan di Bandung? Jika ya, bagaimana kesiapan Anda untuk pindah?\n15. Ada hal lain yang ingin Anda tanyakan terkait posisi ini?"}
{"input_text":"Info Pelamar:\nRaka Wiratama\nInstitut Teknologi Bandung\nTeknik Elektro\n\nJob Description:\n**Keahlian yang dibutuhkan:**\n1. Machine Learning Engineer, minimal pengalaman 2 tahun\n2. Berpengalaman dalam bahasa pemrograman Python dan R\n3. Memiliki pengalaman dalam pengolahan data dengan library seperti Pandas, Numpy, atau PySpark\n4. Mampu membuat, melatih, dan mengoptimasi model machine learning\n5. Berpengalaman dengan framework seperti TensorFlow, PyTorch, atau Scikit-learn\n6. Memiliki pemahaman yang baik tentang algoritma supervised dan unsupervised learning\n7. Berpengalaman dengan deployment model ke lingkungan produksi\n8. Memahami konsep MLOps dan tools seperti Docker, Kubernetes, atau MLflow\n9. Mampu melakukan troubleshooting model yang tidak bekerja optimal\n\n**Persyaratan:**\n1. Sarjana S1 di bidang Teknik/IT/Matematika/Statistika atau sejenis\n2. Memiliki sertifikasi terkait Data Science/Machine Learning/AI\n3. Mampu bekerja secara mandiri maupun dalam tim\n4. Bersedia bekerja di bawah tekanan dengan target yang ketat\n5. Bersedia lembur jika dibutuhkan\n6. Memiliki motivasi tinggi, kritis, inovatif, dan bertanggung jawab\n7. Penempatan di Jakarta","output_text":"1. Apa yang menarik minat Anda untuk berkarier sebagai Machine Learning Engineer?\n2. Bisa ceritakan pengalaman Anda selama di ITB yang relevan dengan machine learning atau pengolahan data?\n3. Dari pengalaman Anda, apa proyek machine learning paling kompleks yang pernah Anda kerjakan, dan apa tantangan utamanya?\n4. Bagaimana Anda memutuskan framework apa yang digunakan, misalnya TensorFlow atau PyTorch, dalam suatu proyek?\n5. Jika Anda diminta untuk mengoptimasi model yang memiliki akurasi rendah, langkah apa yang akan Anda lakukan?\n6. Bagaimana pengalaman Anda dengan deployment model ke lingkungan produksi? Bisa berikan contoh kasus?\n7. Pernahkah Anda menggunakan tools seperti Docker atau Kubernetes dalam proyek Anda? Bagaimana pengalaman Anda?\n8. Dalam suatu kasus, model Anda menunjukkan overfitting. Apa langkah yang Anda ambil untuk memperbaikinya?\n9. Jika Anda bekerja dalam tim dan rekan memiliki pendekatan berbeda dalam pengembangan model, bagaimana Anda menyelesaikan perbedaan ini?\n10. Anda diberi data yang sangat besar namun tidak terstruktur. Apa langkah pertama Anda untuk mengolah data tersebut?\n11. Apa yang memotivasi Anda untuk terus mendalami dunia machine learning?\n12. Bagaimana Anda melihat perkembangan karier Anda di bidang AI dalam lima tahun ke depan?\n13. Apa yang Anda harapkan dari perusahaan ini untuk mendukung perkembangan profesional Anda?\n14. Apakah Anda bersedia untuk penempatan di Jakarta, dan bagaimana Anda mempersiapkan diri untuk itu?\n15. Adakah hal yang ingin Anda tanyakan tentang posisi ini atau perusahaan kami?"}
